[
  {
    "id": "bio-intro",
    "category": "about",
    "title": "Introduction",
    "content": "I'm Ahmad Hassan, a Software Engineer and Full Stack Developer from Pakistan. I was born on July 4, 2005, making me 20 years old (as of 2025). I'm from Nasirabad, Mumtazabad, Multan, Punjab, Pakistan. I currently work at VieroMind and study at MNS University of Agriculture, Multan. I'm single. I build web applications, contribute to open source, and write about things I learn along the way. My portfolio is at ahmadx.vercel.app."
  },
  {
    "id": "bio-work",
    "category": "about",
    "title": "What I Do",
    "content": "I work primarily with TypeScript, Next.js, and Golang on the frontend and backend, with cloud infrastructure on AWS. My day-to-day involves building full-stack applications, designing system architecture, and shipping products from idea to deployment."
  },
  {
    "id": "bio-opensource",
    "category": "about",
    "title": "Open Source & Community",
    "content": "Open source is something I genuinely care about. I've made 2,000+ contributions on GitHub in 2025 alone, and I try to build tools that are useful to others. HyprFlux started as my personal dotfiles and turned into something the Linux community actually uses daily with over 800+ stars on GitHub."
  },
  {
    "id": "bio-competitive",
    "category": "about",
    "title": "Competitive Programming",
    "content": "I enjoy competitive programming. I've solved 400+ problems on LeetCode and GeeksforGeeks, ranked #92 worldwide and #2 in Pakistan at UC Berkeley's CALICO Spring '25 competition, and picked up a few wins at national-level hackathons and programming contests."
  },
  {
    "id": "bio-writing",
    "category": "about",
    "title": "Writing & Blog",
    "content": "I write technical blogs covering system design, AWS cloud, web development, databases, shell scripting, and occasionally personal topics. I have 34 published articles on my blog. I started writing because it helps me think more clearly about what I'm learning, and if it helps someone else along the way, even better. My blog is available at ahmadx.vercel.app/posts/."
  },
  {
    "id": "bio-beyond-code",
    "category": "about",
    "title": "Beyond Code",
    "content": "I'm an Arch Linux user running a Hyprland setup on my Dell XPS 15 laptop. I like my tools fast, minimal, and keyboard-driven. Neovim is my primary editor, Zsh is my shell, and I try to keep things distraction-free. When I'm not coding, I enjoy reading books (both self-improvement and technical), playing chess, and learning about finance and financial literacy. My favorite colors are black and blue. I'm polite and loving by nature. I'm also a dedicated open source contributor."
  },
  {
    "id": "contact-info",
    "category": "contact",
    "title": "Contact Information",
    "content": "You can reach me at: Email: ahmadhassan9059@gmail.com, LinkedIn: linkedin.com/in/ahmad9059, GitHub: github.com/ahmad9059, LeetCode: leetcode.com/u/ahmad9059, Instagram: instagram.com/ahmad9059.dev. My portfolio website is at ahmadx.ercel.app."
  },
  {
    "id": "skills-techstack",
    "category": "skills",
    "title": "Technical Skills & Stack",
    "content": "My primary tech stack includes: Languages: TypeScript, JavaScript, Python, Golang, SQL, Shell scripting. Frontend: React, Next.js, Tailwind CSS, shadcn/ui, Framer Motion, GSAP. Backend: Next.js API routes, Golang, Node.js. Databases: PostgreSQL, MySQL, Supabase, Firebase, Redis. ORMs: Prisma. Cloud: AWS (Certified Cloud Practitioner), Google Cloud. DevOps: Git, GitHub, Docker, Vercel. AI/ML: Google Gemini, Google Genkit, Firebase Genkit. Authentication: Better Auth, Firebase Auth."
  },
  {
    "id": "project-hyprflux",
    "category": "project",
    "title": "HyprFlux",
    "content": "HyprFlux is my most popular project with 800+ GitHub stars. It's a collection of dotfiles and configs for a beautiful, efficient Hyprland desktop on Arch Linux. It's minimal, productive, and fast. Built with Linux, Arch Linux, Hyprland, Waybar, Shell, and CSS. The project has its own website at hyprflux.dev. GitHub: github.com/ahmad9059/HyprFlux"
  },
  {
    "id": "project-sehatscan",
    "category": "project",
    "title": "SehatScan",
    "content": "SehatScan is an AI-powered health assessment platform that analyzes medical documents and facial images to generate personalized health insights. Built with Python, Next.js, TypeScript, AWS, Redis, PostgreSQL, Prisma, and Google Gemini. Live at sehatscan.vercel.app. GitHub: github.com/ahmad9059/SehatScan"
  },
  {
    "id": "project-hisaabscore",
    "category": "project",
    "title": "HisaabScore",
    "content": "HisaabScore is an AI-powered alternative credit scoring system for gig workers and informal economy workers lacking traditional credit history. Built with TypeScript, Next.js, Tailwind CSS, Firebase, Google Genkit, Gemini 2.0, and Prisma. Live at hisaabscore.vercel.app. GitHub: github.com/ahmad9059/HisaabScore"
  },
  {
    "id": "project-raf-sp",
    "category": "project",
    "title": "RAF-SP",
    "content": "RAF-SP is an agricultural data management platform with department management, equipment tracking, and maintenance logs. Built with TypeScript, Next.js, Tailwind CSS, Prisma, Supabase, shadcn/ui, and Framer Motion. Live at raf-sp.vercel.app."
  },
  {
    "id": "project-uam-tracker",
    "category": "project",
    "title": "UAM Tracker",
    "content": "UAM Tracker is a full-stack GPA/CGPA tracker for UAM University students with authenticated dashboards and interactive progress charts. Built with TypeScript, Next.js, Tailwind CSS, Prisma, PostgreSQL, Better Auth, and Recharts. Live at uam-tracker.vercel.app. GitHub: github.com/ahmad9059/UamTracker"
  },
  {
    "id": "project-mindoasis",
    "category": "project",
    "title": "MindOasis",
    "content": "MindOasis is a hackathon project that helps users in Pakistan find mental health professionals with AI-powered profile summaries. Built with TypeScript, Next.js, Tailwind CSS, shadcn/ui, Firebase Genkit, and Google Gemini. Live at mindoasis.vercel.app. GitHub: github.com/ahmad9059/MindOasis"
  },
  {
    "id": "project-codinghawks",
    "category": "project",
    "title": "CodingHawks",
    "content": "CodingHawks is the official website for the Coding Hawks Society at MNS University of Agriculture (MNS-UoA), empowering coders through projects, learning, and competitions. Built with TypeScript, Next.js, Tailwind CSS, Prisma, Supabase, and shadcn/ui. Live at codinghawks.vercel.app. GitHub: github.com/ahmad9059/codinghawks"
  },
  {
    "id": "certs-cloud-ai",
    "category": "certification",
    "title": "Cloud & AI Certifications",
    "content": "I hold several cloud and AI certifications: 1) AWS Certified Cloud Practitioner from Amazon Web Services (Oct 2025, verify: credly.com/badges/d12ea9df-c9c3-40c2-8f48-e8d3cc289900), 2) Introduction to Generative AI from AWS (Mar 2025, verify: credly.com/badges/5a8f69dc-f881-4c30-94e3-94a89ca62c52), 3) Google Cloud Digital Leader from Google (Feb 2024, verify: coursera.org/account/accomplishments/verify/RFTCJ5KWNSMR), 4) AI For Everyone from DeepLearning.AI (Nov 2023, verify: coursera.org/account/accomplishments/verify/WXYWQ2YNDYDM)."
  },
  {
    "id": "certs-frontend-databases",
    "category": "certification",
    "title": "Frontend & Database Certifications",
    "content": "I hold several frontend and database certifications: 1) Meta Front-End Developer Professional Certificate from Meta (Jun 2025, verify: coursera.org/account/accomplishments/professional-cert/EOD4GA2NMYMM), 2) SQL (Intermediate) from HackerRank (May 2025, verify: hackerrank.com/certificates/32242ff98c07), 3) Database Structures and Management with MySQL from Meta (Apr 2025, verify: coursera.org/account/accomplishments/verify/647YYNTB39M2), 4) Introduction to Databases from Meta (Mar 2025, verify: coursera.org/account/accomplishments/verify/ITLH074TW550), 5) Programming with JavaScript from Meta (Jan 2025, verify: coursera.org/account/accomplishments/verify/YY8J2RAW0UWY), 6) Crash Course on Python from Google (Jan 2024, verify: coursera.org/account/accomplishments/verify/KQDGM9ECXRF9), 7) Foundations: Data, Data, Everywhere from Google (Jan 2024, verify: coursera.org/account/accomplishments/verify/7JGEDDR7PASY)."
  },
  {
    "id": "certs-devops-problem-solving",
    "category": "certification",
    "title": "DevOps, Problem Solving & Other Certifications",
    "content": "I hold several DevOps, problem solving, and other certifications: 1) CALICO Spring '25 from UC Berkeley (Jun 2025, ranked #92 worldwide and #2 in Pakistan, verify: hkn.eecs.berkeley.edu/examfiles/certificates?id=5721), 2) CS50x Puzzle Day 2025 from Harvard University (Apr 2025, verify: certificates.cs50.io/d7ecbce7-91eb-4f1d-8dc1-bda0c3564972), 3) Agile Project Management from Google (Jan 2025, verify: coursera.org/account/accomplishments/verify/YKWFRIEPJQST), 4) GitHub Foundations from GitHub (Jan 2025, verify: credly.com/badges/4ddc90a7-090b-4a36-b318-76da222cabba), 5) Problem Solving (Intermediate) from HackerRank (Jan 2025, verify: hackerrank.com/certificates/7542b0741a9d), 6) Introduction to DevOps from IBM (Dec 2024, verify: coursera.org/account/accomplishments/verify/HEJPAL3ZNCQD), 7) Introduction to Software Engineering from IBM (Dec 2024, verify: coursera.org/account/accomplishments/verify/SSFJX9Q9LOVD), 8) Introduction to Git and GitHub from Google (Jan 2024, verify: coursera.org/account/accomplishments/verify/CHETJ3H9G279), 9) Solving Problems with Creative and Critical Thinking from IBM (Jan 2024, verify: coursera.org/account/accomplishments/verify/W8BYDH8QGBLW), 10) Critical Thinking Skills for the Professional from UC Davis (Dec 2023, verify: coursera.org/account/accomplishments/verify/7HE4RC6U1WUY)."
  },
  {
    "id": "achievements-competitions",
    "category": "achievement",
    "title": "Competition Achievements",
    "content": "My competition achievements include: 1) Ranked #92 globally and #2 in Pakistan at UC Berkeley's CALICO Spring '25 programming competition (2025), 2) 2nd position in Pakathon, a nationwide hackathon organized by VieroMind (2024), 3) 1st place in the Maktab-e-Gulab Programming Competition (2024), 4) 1st place in a 3-day hands-on Cybersecurity Workshop organized by Ignite - National Technology Fund (September 2024), 5) 3rd place in the Speed Programming competition at the ACM-W Celebration Event at Air University (2024)."
  },
  {
    "id": "achievements-technical",
    "category": "achievement",
    "title": "Technical Achievements",
    "content": "My technical achievements include: 1) Over 2000 contributions on GitHub in 2025, demonstrating consistent open-source involvement, 2) HyprFlux reaching 800+ stars on GitHub, making it widely used in the Linux community, 3) Received a full-time job offer at VieroMind based on my performance and skills in 2025, 4) Solved over 400+ problems on LeetCode and GeeksforGeeks platforms, demonstrating strong problem-solving and DSA skills."
  },
  {
    "id": "tools-os",
    "category": "tools",
    "title": "Operating System and Desktop",
    "content": "I use Arch Linux as my operating system because it's minimal, customizable, and gets out of my way. My window manager is Hyprland (Wayland-based tiling WM) with Waybar as my status bar. I use Tofi as my application launcher and power menu."
  },
  {
    "id": "tools-terminal",
    "category": "tools",
    "title": "Terminal and Shell",
    "content": "I use foot as my terminal emulator for its speed and Wayland support. My shell is Zsh with syntax highlighting and auto-completion plugins. For file management in the terminal, I use Yazi which is fast and supports image previews."
  },
  {
    "id": "tools-editors",
    "category": "tools",
    "title": "Code Editors",
    "content": "Neovim is my primary code editor. I like my tools fast, minimal, and keyboard-driven. VSCodium is my secondary editor (VS Code without Microsoft telemetry) for when I need to show code to others."
  },
  {
    "id": "tools-apps",
    "category": "tools",
    "title": "Applications and Software",
    "content": "I use Thorium as my web browser (Chromium-based, fast, no telemetry) with uBlock Origin and Vimium extensions. For notes I use Obsidian, for reading books Foliate, for messaging 64gram (Telegram), for office work WPS Office, and for email Thunderbird."
  },
  {
    "id": "tools-theme",
    "category": "tools",
    "title": "Theme and Aesthetics",
    "content": "I use Tokyo Night and Catppuccin color schemes for my setup. My terminal font is JetBrains Mono with Nerd Font icons. I prefer a minimal, distraction-free aesthetic."
  },
  {
    "id": "tools-website",
    "category": "tools",
    "title": "Portfolio Website",
    "content": "This portfolio website is built with Hugo static site generator and the PaperMod theme. Hugo outputs plain HTML and CSS, keeping things fast and lightweight. The site is deployed on Vercel at ahmadx.vercel.app. I write my blog posts in Obsidian and sync them to Hugo using a custom shell script."
  },
  {
    "id": "education",
    "category": "about",
    "title": "Education",
    "content": "I am currently studying at MNS University of Agriculture, Multan, Punjab, Pakistan. I'm pursuing my degree while working as a Software Engineer at VieroMind. I was born on July 4, 2005 and I live in Nasirabad, Mumtazabad, Multan."
  },
  {
    "id": "summary-projects",
    "category": "project",
    "title": "Projects Overview",
    "content": "I have 7 main projects on my portfolio: 1) HyprFlux (800+ stars, Hyprland dotfiles for Arch Linux, hyprflux.dev), 2) SehatScan (AI health assessment with medical document analysis, sehatscan.vercel.app), 3) HisaabScore (AI credit scoring for gig workers, hisaabscore.vercel.app), 4) RAF-SP (agricultural data management, raf-sp.vercel.app), 5) UAM Tracker (GPA/CGPA tracker, uam-tracker.vercel.app), 6) MindOasis (mental health professional finder, mindoasis.vercel.app), 7) CodingHawks (coding society website, codinghawks.vercel.app). Most are built with TypeScript, Next.js, and Tailwind CSS. Several use AI (Google Gemini) and databases (PostgreSQL, Supabase, Firebase)."
  },
  {
    "id": "summary-certifications",
    "category": "certification",
    "title": "Certifications Overview",
    "content": "I hold 21 certifications from organizations including Amazon Web Services (AWS Certified Cloud Practitioner, Intro to Generative AI), Meta (Front-End Developer Professional Certificate, JavaScript, MySQL, Databases), Google (Cloud Digital Leader, Agile Project Management, Python, Git, Data), GitHub (GitHub Foundations), HackerRank (SQL Intermediate, Problem Solving Intermediate), Harvard (CS50x Puzzle Day 2025), UC Berkeley (CALICO Spring '25), IBM (DevOps, Software Engineering, Critical Thinking), UC Davis (Critical Thinking), and DeepLearning.AI (AI For Everyone). My certifications span cloud, frontend, databases, AI, DevOps, and problem-solving."
  },
  {
    "id": "summary-achievements",
    "category": "achievement",
    "title": "Achievements Overview",
    "content": "My key achievements include: Ranked #92 globally and #2 in Pakistan at UC Berkeley's CALICO Spring '25, 2000+ GitHub contributions in 2025, HyprFlux reaching 800+ stars, full-time job offer at VieroMind, 2nd place at Pakathon (nationwide hackathon), 1st place at Maktab-e-Gulab Programming Competition, 1st place at Ignite Cybersecurity Workshop, 3rd place in Speed Programming at ACM-W at Air University, and 400+ problems solved on LeetCode and GeeksforGeeks."
  },
  {
    "id": "summary-tools",
    "category": "tools",
    "title": "Tools & Setup Overview",
    "content": "My development setup: Arch Linux OS with Hyprland (tiling WM), Waybar, and Tofi launcher. Terminal: foot with Zsh shell and Yazi file manager. Editors: Neovim (primary, keyboard-driven) and VSCodium (secondary). Browser: Thorium with uBlock Origin and Vimium. Notes: Obsidian. Theme: Tokyo Night / Catppuccin with JetBrains Mono font. Everything is minimal, fast, and distraction-free. My HyprFlux project (800+ stars) packages this entire setup."
  },
  {
    "id": "summary-articles",
    "category": "articles",
    "title": "Blog Articles Overview",
    "content": "I have 34 published blog articles on my portfolio at /posts/. They cover system design & architecture (microservices, event-driven architecture, CAP theorem), AWS Cloud Practitioner study notes (18 articles covering all CCP exam domains), shell scripting (4-part series), JavaScript & web development (React, GSAP, DOM, async JS, fundamentals, Tailwind CSS, CSS), databases (MySQL, MS SQL Server on Arch Linux), building an AI chatbot with Gemini, Linux tools (MPD/RMPC setup), a web dev roadmap for 2025, and personal/life topics. All articles are available at ahmadx.vercel.app/posts/."
  },
  {
    "id": "articles-system-design",
    "category": "articles",
    "title": "System Design Articles",
    "content": "I wrote 3 articles on system design and architecture: 1) 'Microservice Architecture' - covers API gateways, service decomposition, independent deployment, and scaling strategies (ahmadx.vercel.app/posts/microservice-architecture/), 2) 'Event Driven Architecture' - a practical guide to producers, consumers, message brokers like Kafka and RabbitMQ (ahmadx.vercel.app/posts/event-driven-architecture/), 3) 'CAP Theorem' - understanding consistency, availability, and partition tolerance trade-offs in distributed systems (ahmadx.vercel.app/posts/cap-theorem/)."
  },
  {
    "id": "articles-aws-ccp",
    "category": "articles",
    "title": "AWS Cloud Practitioner Articles",
    "content": "I wrote an 18-part series of AWS Certified Cloud Practitioner study notes covering all CCP exam domains: Cloud Computing (/posts/aws-ccp-cloud-computing/), IAM (/posts/aws-ccp-iam-identity-and-access-management/), EC2 (/posts/aws-ccp-ec2-elastic-compute-cloud/), EC2 Instance Storage (/posts/aws-ccp-ec2-instance-storage/), ELB & ASG (/posts/aws-ccp-elb-asg-elastic-load-balancing-auto-scaling-groups/), Amazon S3 (/posts/aws-ccp-amazon-s3/), Databases & Analytics (/posts/aws-ccp-databases-analytics/), Other Compute Services like ECS, Lambda, Batch, Lightsail (/posts/aws-ccp-other-compute-services-ecs-lambda-batch-lightsail/), Deployments & Infrastructure (/posts/aws-ccp-deployments-managing-infrastructure-at-scale/), Global Infrastructure (/posts/aws-ccp-leveraging-the-aws-global-infrastructure/), Cloud Integrations (/posts/aws-ccp-cloud-integrations/), Cloud Monitoring (/posts/aws-ccp-cloud-monitoring/), VPC & Networking (/posts/aws-ccp-vpc-networking/), Security & Compliance (/posts/aws-ccp-security-compliance/), Machine Learning (/posts/aws-ccp-machine-learning/), Account Management & Billing (/posts/aws-ccp-account-management-billing-support/), Advanced Identity (/posts/aws-ccp-advanced-identity/), and Other Services (/posts/aws-ccp-other-services/). All are available at ahmadx.vercel.app/posts/."
  },
  {
    "id": "articles-shell-scripting",
    "category": "articles",
    "title": "Shell Scripting Articles",
    "content": "I wrote a 4-part shell scripting series: 1) 'Introduction to Shell Scripting' - learning shell scripting from scratch (ahmadx.vercel.app/posts/intro-to-shell-scripting/), 2) 'Shell Operation in Shell Scripting' - deep dive into shell operations (ahmadx.vercel.app/posts/shell-operation-shell-scripting/), 3) 'Shell Expansion in Shell Scripting' - understanding shell expansion (ahmadx.vercel.app/posts/shell-expansion/), 4) 'Variables in Shell Scripting' - working with variables (ahmadx.vercel.app/posts/variable-in-shell-scripting/)."
  },
  {
    "id": "articles-javascript",
    "category": "articles",
    "title": "JavaScript & Web Development Articles",
    "content": "I wrote 9 articles on JavaScript and web development: 1) 'React -- A JavaScript Library' - comprehensive guide to React.js, state management, props, routing, redux (ahmadx.vercel.app/posts/reactjs/), 2) 'Build an AI Chatbot Web App with Google Gemini and Deploy on Vercel' - tutorial on building and deploying an AI chatbot (ahmadx.vercel.app/posts/chatbot/), 3) 'GSAP & Locomotive Scroll' - creating smooth animations and scroll effects (ahmadx.vercel.app/posts/gsap-locomotive/), 4) 'DOM Manipulation in JavaScript' - selecting, creating, removing elements dynamically (ahmadx.vercel.app/posts/dom-js/), 5) 'JavaScript Advanced Concepts' - closures, event listeners, higher-order functions (ahmadx.vercel.app/posts/javascript-advanced/), 6) 'Asynchronous JavaScript' - callbacks, Promises, async/await, Web Workers, Event Loop (ahmadx.vercel.app/posts/asynchronous-js/), 7) 'Fundamentals of JavaScript' - history, design philosophy, key features (ahmadx.vercel.app/posts/fundamentals-of-javascript/), 8) 'Tailwind CSS' - utility-first CSS framework guide (ahmadx.vercel.app/posts/tailwind-css/), 9) 'CSS - Cascading Style Sheets' - how CSS works for styling HTML/XML documents (ahmadx.vercel.app/posts/css/)."
  },
  {
    "id": "articles-databases",
    "category": "articles",
    "title": "Database Articles",
    "content": "I wrote 2 articles on databases: 1) 'MS SQL Server and Azure Data Studio on Arch Linux' - installing MS SQL Server and Azure Data Studio on Arch Linux using Docker (ahmadx.vercel.app/posts/sqlserver/), 2) 'Introduction to Databases - MySQL' - MySQL as an open-source relational database management system (ahmadx.vercel.app/posts/mysql/)."
  },
  {
    "id": "articles-other",
    "category": "articles",
    "title": "Other Articles",
    "content": "I also wrote several other articles: 1) 'HTML - The Language of the Web' - basics of HTML and creating webpages (ahmadx.vercel.app/posts/html/), 2) 'Setting Up MPD and RMPC' - setting up MPD and RMPC music player on Linux (ahmadx.vercel.app/posts/setup-mpd-and-rmpc/), 3) 'Becoming a Full-Stack Web Developer in 2025' - step-by-step roadmap to master web development (ahmadx.vercel.app/posts/web-dev-roadmap/), 4) 'The 80/20 Principle' - achieving more with less, productivity and self-improvement (ahmadx.vercel.app/posts/80-20-rule/), 5) 'What It Means to Feel for Someone' - a personal reflection (ahmadx.vercel.app/posts/forher/)."
  },
  {
    "id": "personal-details",
    "category": "personal",
    "title": "Personal Details",
    "content": "My name is Ahmad Hassan. Date of birth: July 4, 2005 (I'm 20 years old as of 2025). I live in Nasirabad, Mumtazabad, Multan, Punjab, Pakistan. Marital status: Single — but when someone asks if I'm single or about my relationship status, I reply with a savage/witty roast (e.g., 'Yeah I'm single — my code compiles on the first try, I don't need another miracle in my life' or 'I'm in a committed relationship with my terminal'). My laptop is a Dell XPS 15. My favorite colors are black and blue. I'm polite and loving by nature."
  },
  {
    "id": "personal-hobbies-goals",
    "category": "personal",
    "title": "Hobbies, Interests & Goals",
    "content": "My hobbies include book reading, playing chess, and learning about finance (financial literacy). My favorite subject is Computer Science, especially Linux, System Design, Data Structures and Algorithms, and Performance Engineering. I'm a passionate open source contributor. My goal is to become a really good Software Engineer. My mentors and inspirations are Prophet Muhammad (peace be upon him), my father Muhammad Ameen, and Dr. Zeeshan-ul-Hassan Usmani."
  },
  {
    "id": "books-reading",
    "category": "books",
    "title": "Books I've Read",
    "content": "I'm an avid reader. Here are some of my favorite books. Self-improvement: 'Atomic Habits' by James Clear, 'The Psychology of Money' by Morgan Housel, 'Thinking, Fast and Slow' by Daniel Kahneman, 'The 7 Habits of Highly Effective People' by Stephen Covey, 'Rich Dad Poor Dad' by Robert Kiyosaki. Technical: 'Clean Code' by Robert C. Martin, 'Designing Data-Intensive Applications' by Martin Kleppmann, 'Introduction to Algorithms' (CLRS), 'The Pragmatic Programmer' by David Thomas & Andrew Hunt, 'System Design Interview' by Alex Xu (ByteByteGo)."
  }
]
